Abhiyadav0/MyMCU/stm32f0xx_driver/Bsp/LCD.h
/*
 * LCD.h
 *
 *  Created on: 27-Sep-2022
 *      Author: Abhi
 */

#ifndef LCD_H_
#define LCD_H_
#include "stm32f030xx.h"

/* bsp exposed apis */
void lcd_init(void);
void lcd_send_command(uint8_t cmd);
void lcd_print_char(uint8_t data);
void lcd_display_clear(void);
void lcd_display_return_home(void);
void lcd_print_string(char*);
void lcd_set_cursor(uint8_t row, uint8_t column);

void DisplayLCD2Digit(char LineNumber,char CharPosition,char Data);
void LCD_SL(void);
void LCD_SR(void);

/*Application configurable items */

#define LCD_GPIO_PORT  GPIOC
#define LCD_GPIO_PORT2 GPIOA
#define LCD_GPIO_RS	   GPIO_PIN_NO_6                  //GPIO PORTC PIN
#define LCD_GPIO_RW	   0                              //GPIO PORTC PIN
#define LCD_GPIO_EN	   GPIO_PIN_NO_7                  //GPIO PORTC PIN
#define LCD_GPIO_D4	   GPIO_PIN_NO_8                  //GPIO PORTC PIN
#define LCD_GPIO_D5	   GPIO_PIN_NO_9                  //GPIO PORTC PIN
#define LCD_GPIO_D6	   GPIO_PIN_NO_8                  //GPIO PORTA PIN
#define LCD_GPIO_D7	   GPIO_PIN_NO_11                 //GPIO PORTA PIN


/*LCD commands */
#define LCD_CMD_4DL_2N_5X8F  		0x28
#define LCD_CMD_DON_CURON    		0x0E
#define LCD_CMD_INCADD       		0x06
#define LCD_CMD_DIS_CLEAR    		0X01
#define LCD_CMD_DIS_RETURN_HOME  	0x02


#endif /* LCD_H_ */
